RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_dmac.c
/******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 */
/******************************************************************************/
/** \file hc32f460_dmac.c
 **
 ** A detailed description is available at
 ** @link DmacGroup DMAC description @endlink
 **
 **   - 2018-11-18  CDT  First version for Device Driver Library of DMAC.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f460_dmac.h"
#include "hc32f460_utility.h"

#if (DDL_DMAC_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup DmacGroup
 ******************************************************************************/
//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
#define DMA_CNT                             (10u)
#define DMA_IDLE                            (0u)
#define DMA_BUSY                            (1u)

#define DMACH0                              (0x01u)
#define DMACH1                              (0x02u)
#define DMACH2                              (0x04u)
#define DMACH3                              (0x08u)

#define DMATIMEOUT1                         (0x5000u)
#define DMATIMEOUT2                         (0x1000u)

#define DMA_CHCTL_DEFAULT                   (0x00001000ul)
#define DMA_DTCTL_DEFAULT                   (0x00000001ul)
#define DMA_DAR_DEFAULT                     (0x00000000ul)
#define DMA_SAR_DEFAULT                     (0x00000000ul)
#define DMA_RPT_DEFAULT                     (0x00000000ul)
#define DMA_LLP_DEFAULT                     (0x00000000ul)
#define DMA_SNSEQCTL_DEFAULT                (0x00000000ul)
#define DMA_DNSEQCTL_DEFAULT                (0x00000000ul)
#define DMA_RCFGCTL_DEFAULT                 (0x00000000ul)

/*****************  Bits definition for DMA_INTSTAT0 register  ****************/
#define DMA_INTSTAT0_TRNERR_Pos             (0U)                                /*!< DMA_INTSTAT0: TRNERR Position */
#define DMA_INTSTAT0_REQERR_Pos             (16U)                               /*!< DMA_INTSTAT0: REQERR Position */

/*****************  Bits definition for DMA_INTSTAT1 register  ****************/
#define DMA_INTSTAT1_TC_Pos                 (0U)                                /*!< DMA_INTSTAT1: TC Position */
#define DMA_INTSTAT1_BTC_Pos                (16U)                               /*!< DMA_INTSTAT1: BTC Position */

/*****************  Bits definition for DMA_INTMASK0 register  ****************/
#define DMA_INTMASK0_MSKTRNERR_Pos          (0U)                                /*!< DMA_INTMASK0: MSKTRNERR Position */
#define DMA_INTMASK0_MSKREQERR_Pos          (16U)                               /*!< DMA_INTMASK0: MSKREQERR Position */

/*****************  Bits definition for DMA_INTMASK1 register  ****************/
#define DMA_INTMASK1_MSKTC_Pos              (0U)                                /*!< DMA_INTMASK1: MSKTC Position */
#define DMA_INTMASK1_MSKBTC_Pos             (16U)                               /*!< DMA_INTMASK1: MSKBTC Position */

/*****************  Bits definition for DMA_INTCLR0 register  *****************/
#define DMA_INTCLR0_CLRTRNERR_Pos           (0U)                                /*!< DMA_INTCLR0: CLRTRNERR Position */
#define DMA_INTCLR0_CLRREQERR_Pos           (16U)                               /*!< DMA_INTCLR0: CLRREQERR Position */

/*****************  Bits definition for DMA_INTCLR1 register  *****************/
#define DMA_INTCLR1_CLRTC_Pos               (0U)                                /*!< DMA_INTCLR1: CLRTC Position */
#define DMA_INTCLR1_CLRBTC_Pos              (16U)                               /*!< DMA_INTCLR1: CLRBTC Position */

/*******************  Bits definition for DMA_CHEN register  ******************/
#define DMA_CHEN_CHEN_Pos                   (0U)                                /*!< DMA_CHEN: CHEN Position */

/**************  Bits definition for DMA_DTCTLx(x=0~3) register  **************/
#define DMA_DTCTL_BLKSIZE_Pos               (0ul)                                /*!< DMA_DTCTLx: BLKSIZE Position */
#define DMA_DTCTL_BLKSIZE_Msk               (0x3FFul << DMA_DTCTL_BLKSIZE_Pos)   /*!< DMA_DTCTLx: BLKSIZE Mask 0x000003FF */
#define DMA_DTCTL_BLKSIZE                   (DMA_DTCTL_BLKSIZE_Msk)

#define DMA_DTCTL_CNT_Pos                   (16ul)                               /*!< DMA_DTCTLx: CNT Position */
#define DMA_DTCTL_CNT_Msk                   (0xFFFFul << DMA_DTCTL_CNT_Pos)      /*!< DMA_DTCTLx: CNT Mask 0xFFFF0000 */
#define DMA_DTCTL_CNT                       (DMA_DTCTL_CNT_Msk)

/***************  Bits definition for DMA_RPTx(x=0~3) register  ***************/
#define DMA_RPT_SRPT_Pos                    (0ul)                                /*!< DMA_RPTx: SRPT Position */
#define DMA_RPT_SRPT_Msk                    (0x3FFul << DMA_RPT_SRPT_Pos)        /*!< DMA_RPTx: SRPT Mask 0x000003FF */
#define DMA_RPT_SRPT                        (DMA_RPT_SRPT_Msk)

#define DMA_RPT_DRPT_Pos                    (16ul)                               /*!< DMA_RPTx: DRPT Position */
#define DMA_RPT_DRPT_Msk                    (0x3FFul << DMA_RPT_DRPT_Pos)        /*!< DMA_RPTx: DRPT Mask 0x03FF0000 */
#define DMA_RPT_DRPT                        (DMA_RPT_DRPT_Msk)

/***************  Bits definition for DMA_RPTBx(x=0~3) register  ***************/
#define DMA_RPTB_SRPTB_Pos                  (0ul)                                /*!< DMA_RPTBx: SRPTB Position */
#define DMA_RPTB_SRPTB_Msk                  (0x3FFul << DMA_RPTB_SRPTB_Pos)      /*!< DMA_RPTBx: SRPTB Mask 0x000003FF */
#define DMA_RPTB_SRPTB                      (DMA_RPTB_SRPTB_Msk)

#define DMA_RPTB_DRPTB_Pos                  (16ul)                               /*!< DMA_RPTBx: DRPTB Position */
#define DMA_RPTB_DRPTB_Msk                  (0x3FFul << DMA_RPTB_DRPTB_Pos)      /*!< DMA_RPTBx: DRPTB Mask 0x03FF0000 */
#define DMA_RPTB_DRPTB                      (DMA_RPTB_DRPTB_Msk)

/*************  Bits definition for DMA_SNSEQCTLx(x=0~3) register  ************/
#define DMA_SNSEQCTL_SOFFSET_Pos            (0ul)                                /*!< DMA_SNSEQCTLx: SOFFSET Position */
#define DMA_SNSEQCTL_SOFFSET_Msk            (0xFFFFFul << DMA_SNSEQCTL_SOFFSET_Pos)      /*!< DMA_SNSEQCTLx: SOFFSET Mask 0x000FFFFF */
#define DMA_SNSEQCTL_SOFFSET                (DMA_SNSEQCTL_SOFFSET_Msk)

