RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_dmac.c
#define DMA_SNSEQCTL_SNSCNT_Pos             (20ul)                               /*!< DMA_SNSEQCTLx: SNSCNT Position */
#define DMA_SNSEQCTL_SNSCNT_Msk             (0xFFFul << DMA_SNSEQCTL_SNSCNT_Pos)         /*!< DMA_SNSEQCTLx: SNSCNT Mask 0xFFF00000 */
#define DMA_SNSEQCTL_SNSCNT                 (DMA_SNSEQCTL_SNSCNT_Msk)

/*************  Bits definition for DMA_SNSEQCTLBx(x=0~3) register  ************/
#define DMA_SNSEQCTLB_SNSDIST_Pos           (0ul)                                /*!< DMA_SNSEQCTLBx: SNSDIST Position */
#define DMA_SNSEQCTLB_SNSDIST_Msk           (0xFFFFFul << DMA_SNSEQCTLB_SNSDIST_Pos)     /*!< DMA_SNSEQCTLBx: SNSDIST Mask 0x000FFFFF */
#define DMA_SNSEQCTLB_SNSDIST               (DMA_SNSEQCTLB_SNSDIST_Msk)

#define DMA_SNSEQCTLB_SNSCNTB_Pos           (20ul)                               /*!< DMA_SNSEQCTLBx: SNSCNTB Position */
#define DMA_SNSEQCTLB_SNSCNTB_Msk           (0xFFFul << DMA_SNSEQCTLB_SNSCNTB_Pos)       /*!< DMA_SNSEQCTLBx: SNSCNTB Mask 0xFFF00000 */
#define DMA_SNSEQCTLB_SNSCNTB               (DMA_SNSEQCTLB_SNSCNTB_Msk)

/*************  Bits definition for DMA_DNSEQCTLx(x=0~3) register  ************/
#define DMA_DNSEQCTL_DOFFSET_Pos            (0ul)                                /*!< DMA_DNSEQCTLx: DOFFSET Position */
#define DMA_DNSEQCTL_DOFFSET_Msk            (0xFFFFFul << DMA_DNSEQCTL_DOFFSET_Pos)      /*!< DMA_DNSEQCTLx: DOFFSET Mask 0x000FFFFF */
#define DMA_DNSEQCTL_DOFFSET                (DMA_DNSEQCTL_DOFFSET_Msk)

#define DMA_DNSEQCTL_DNSCNT_Pos             (20ul)                               /*!< DMA_DNSEQCTLx: DNSCNT Position */
#define DMA_DNSEQCTL_DNSCNT_Msk             (0xFFFul << DMA_DNSEQCTL_DNSCNT_Pos)         /*!< DMA_DNSEQCTLx: DNSCNT Mask 0xFFF00000 */
#define DMA_DNSEQCTL_DNSCNT                 (DMA_DNSEQCTL_DNSCNT_Msk)

/*************  Bits definition for DMA_DNSEQCTLx(x=0~3) register  ************/
#define DMA_DNSEQCTLB_DNSDIST_Pos           (0ul)                                /*!< DMA_DNSEQCTLBx: DNSDIST Position */
#define DMA_DNSEQCTLB_DNSDIST_Msk           (0xFFFFFul << DMA_DNSEQCTLB_DNSDIST_Pos)      /*!< DMA_DNSEQCTLBx: DNSDIST Mask 0x000FFFFF */
#define DMA_DNSEQCTLB_DNSDIST               (DMA_DNSEQCTLB_DNSDIST_Msk)

#define DMA_DNSEQCTLB_DNSCNTB_Pos           (20ul)                               /*!< DMA_DNSEQCTLBx: DNSCNTB Position */
#define DMA_DNSEQCTLB_DNSCNTB_Msk           (0xFFFul << DMA_DNSEQCTLB_DNSCNTB_Pos)         /*!< DMA_DNSEQCTLBx: DNSCNTB Mask 0xFFF00000 */
#define DMA_DNSEQCTLB_DNSCNTB               (DMA_DNSEQCTLB_DNSCNTB_Msk)

/****************  Bits definition for DMA_LLPx(x=0~7) register  **************/
#define DMA_LLP_LLP_Pos                     (2ul)                                /*!< DMA_LLPx: LLP Position */
#define DMA_LLP_LLP_Msk                     (0x3FFFFFFFul << DMA_LLP_LLP_Pos)    /*!< DMA_LLPx: LLP Mask 0xFFFFFFC */
#define DMA_LLP_LLP                         (DMA_LLP_LLP_Msk)

/***************  Bits definition for DMA_CHxCTL(x=0~3) register  *************/
#define DMA_CHCTL_SINC_Pos                  (0ul)                                /*!< DMA_CHxCTL: SINC Position */
#define DMA_CHCTL_SINC_Msk                  (0x3ul << DMA_CHCTL_SINC_Pos)        /*!< DMA_CHxCTL: SINC Mask 0x00000003 */
#define DMA_CHCTL_SINC                      (DMA_CHCTL_SINC_Msk)

#define DMA_CHCTL_DINC_Pos                  (2ul)                                /*!< DMA_CHxCTL: DINC Position */
#define DMA_CHCTL_DINC_Msk                  (0x3ul << DMA_CHCTL_DINC_Pos)        /*!< DMA_CHxCTL: DINC Mask 0x0000000C */
#define DMA_CHCTL_DINC                      (DMA_CHCTL_DINC_Msk)

#define DMA_CHCTL_SRPTEN_Pos                (4ul)                                /*!< DMA_CHxCTL: SRPTEN Position */
#define DMA_CHCTL_SRPTEN_Msk                (0x1ul << DMA_CHCTL_SRPTEN_Pos)      /*!< DMA_CHxCTL: SRPTEN Mask 0x00000010 */
#define DMA_CHCTL_SRPTEN                    (DMA_CHCTL_SRPTEN_Msk)

#define DMA_CHCTL_DRPTEN_Pos                (5ul)                                /*!< DMA_CHxCTL: DRPTEN Position */
#define DMA_CHCTL_DRPTEN_Msk                (0x1ul << DMA_CHCTL_DRPTEN_Pos)      /*!< DMA_CHxCTL: DRPTEN Mask 0x00000020 */
#define DMA_CHCTL_DRPTEN                    (DMA_CHCTL_DRPTEN_Msk)

#define DMA_CHCTL_SNSEQEN_Pos               (6ul)                                /*!< DMA_CHxCTL: SNSEQEN Position */
#define DMA_CHCTL_SNSEQEN_Msk               (0x1ul << DMA_CHCTL_SNSEQEN_Pos)      /*!< DMA_CHxCTL: SNSEQEN Mask 0x00000040 */
#define DMA_CHCTL_SNSEQEN                   (DMA_CHCTL_SNSEQEN_Msk)

#define DMA_CHCTL_DNSEQEN_Pos               (7ul)                                /*!< DMA_CHxCTL: DNSEQEN Position */
#define DMA_CHCTL_DNSEQEN_Msk               (0x1ul << DMA_CHCTL_DNSEQEN_Pos)      /*!< DMA_CHxCTL: DNSEQEN Mask 0x00000080 */
#define DMA_CHCTL_DNSEQEN                   (DMA_CHCTL_DNSEQEN_Msk)

#define DMA_CHCTL_HSIZE_Pos                 (8ul)                                /*!< DMA_CHxCTL: HSIZE Position */
#define DMA_CHCTL_HSIZE_Msk                 (0x3ul << DMA_CHCTL_HSIZE_Pos)       /*!< DMA_CHxCTL: HSIZE Mask 0x00000300 */
#define DMA_CHCTL_HSIZE                     (DMA_CHCTL_HSIZE_Msk)

#define DMA_CHCTL_LLPEN_Pos                 (10ul)                               /*!< DMA_CHxCTL: LLPEN Position */
#define DMA_CHCTL_LLPEN_Msk                 (0x1ul << DMA_CHCTL_LLPEN_Pos)       /*!< DMA_CHxCTL: LLPEN Mask 0x00000400 */
#define DMA_CHCTL_LLPEN                     (DMA_CHCTL_LLPEN_Msk)

#define DMA_CHCTL_LLPRUN_Pos                (11ul)                               /*!< DMA_CHxCTL: LLPRUN Position */
#define DMA_CHCTL_LLPRUN_Msk                (0x1ul << DMA_CHCTL_LLPRUN_Pos)      /*!< DMA_CHxCTL: LLPRUN Mask 0x00000800 */
#define DMA_CHCTL_LLPRUN                    (DMA_CHCTL_LLPRUN_Msk)

#define DMA_CHCTL_IE_Pos                    (12ul)                               /*!< DMA_CHxCTL: IE Position */
#define DMA_CHCTL_IE_Msk                    (0x1ul << DMA_CHCTL_IE_Pos)          /*!< DMA_CHxCTL: IE Mask 0x00001000 */
#define DMA_CHCTL_IE                        (DMA_CHCTL_IE_Msk)

/***********************  DMA REGISTERx(x=0~3) register  **********************/
#define _DMA_CH_REG_OFFSET(ch)              ((ch) * 0x40ul)
#define _DMA_CH_REG(reg_base, ch)           (*(volatile uint32_t *)((uint32_t)(reg_base) + _DMA_CH_REG_OFFSET(ch)))

#define WRITE_DMA_CH_REG(reg_base, ch, val)         (_DMA_CH_REG((reg_base), (ch)) = (val))
#define READ_DMA_CH_REG(reg_base, ch)               (_DMA_CH_REG((reg_base), (ch)))

#define SET_DMA_CH_REG_BIT(reg_base, ch, pos)       (_DMA_CH_REG((reg_base), (ch)) |= (1ul << (pos)))
#define CLR_DMA_CH_REG_BIT(reg_base, ch, pos)       (_DMA_CH_REG((reg_base), (ch)) &= (~(1ul << (pos))))

#define WRITE_DMA_CH_TRGSEL(reg_base, ch, val)      ((*(volatile uint32_t *)((uint32_t)(reg_base) + (ch) * 4ul)) = (val))

#define MODIFY_DMA_CH_REG(reg_base, ch, msk, val)   {do { \
    WRITE_DMA_CH_REG((reg_base), (ch), ((READ_DMA_CH_REG((reg_base), (ch)) & (~(msk))) | ((val) << (msk##_Pos)))); \
} while(0);}

