RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_dmac.c
/*! Parameter valid check for Dmac register pointer. */
#define IS_VALID_DMA_REG(x)                                                    \
(   (M4_DMA1 == (x))                     ||                                    \
    (M4_DMA2 == (x)))

/*! Parameter valid check for Dmac Channel. */
#define IS_VALID_CH(x)                                                         \
(   (DmaCh0 == (x))                      ||                                    \
    (DmaCh1 == (x))                      ||                                    \
    (DmaCh2 == (x))                      ||                                    \
    (DmaCh3 == (x)))

/*! Parameter valid check for Dmac irq selection. */
#define IS_VALID_IRQ_SEL(x)                                                    \
(   (TrnErrIrq == (x))                   ||                                    \
    (TrnReqErrIrq == (x))                ||                                    \
    (TrnCpltIrq == (x))                  ||                                    \
    (BlkTrnCpltIrq == (x)))

/*! Parameter valid check for Dmac re_config count mode. */
#define IS_VALID_CNT_MODE(x)                                                   \
(   (CntFix == (x))                      ||                                    \
    (CntSrcAddr == (x))                  ||                                    \
    (CntDesAddr == (x)))

/*! Parameter valid check for Dmac re_config source address mode. */
#define IS_VALID_SADDR_MODE(x)                                                 \
(   (SaddrFix == (x))                    ||                                    \
    (SaddrNseq == (x))                   ||                                    \
    (SaddrRep == (x)))

/*! Parameter valid check for Dmac re_config destination address mode. */
#define IS_VALID_DADDR_MODE(x)                                                 \
(   (DaddrFix == (x))                    ||                                    \
    (DaddrNseq == (x))                   ||                                    \
    (DaddrRep == (x)))

/*! Parameter valid check for Dmac status. */
#define IS_VALID_DMA_STA(x)                                                    \
(   (DmaSta == (x))                      ||                                    \
    (ReCfgSta == (x))                    ||                                    \
    (DmaCh0Sta == (x))                   ||                                    \
    (DmaCh1Sta == (x))                   ||                                    \
    (DmaCh2Sta == (x))                   ||                                    \
    (DmaCh3Sta == (x)))

/*! Parameter valid check for Dmac transfer data width. */
#define IS_VALID_TRN_WIDTH(x)                                                  \
(   (Dma8Bit == (x))                     ||                                    \
    (Dma16Bit == (x))                    ||                                    \
    (Dma32Bit == (x)))

/*! Parameter valid check for Dmac address mode. */
#define IS_VALID_ADDR_MODE(x)                                                  \
(   (AddressFix == (x))                  ||                                    \
    (AddressIncrease == (x))             ||                                    \
    (AddressDecrease == (x)))

/*! Parameter valid check for Dmac link-list-pointer mode. */
#define IS_VALID_LLP_MODE(x)                                                   \
(   (LlpWaitNextReq == (x))              ||                                    \
    (LlpRunNow == (x)))

/*! Parameter validity check for DMA common trigger. */
#define IS_DMA_COM_TRIGGER(x)                                                  \
(   ((x) == DmaComTrigger_1)             ||                                    \
    ((x) == DmaComTrigger_2)             ||                                    \
    ((x) == DmaComTrigger_1_2))

/*! Parameter valid check for Dmac transfer block size. */
#define IS_VALID_BLKSIZE(x)                                                    \
(   !((x) & (uint16_t)(~(DMA_DTCTL_BLKSIZE_Msk >> DMA_DTCTL_BLKSIZE_Pos))))

/*! Parameter valid check for Dmac transfer count. */
#define IS_VALID_TRNCNT(x)                                                     \
(   !((x) & ~(DMA_DTCTL_CNT_Msk >> DMA_DTCTL_CNT_Pos)))

/*! Parameter valid check for Dmac source repeat size. */
#define IS_VALID_SRPT_SIZE(x)                                                  \
(   !((x) & ~(DMA_RPT_SRPT_Msk >> DMA_RPT_SRPT_Pos)))

/*! Parameter valid check for Dmac destination repeat size. */
#define IS_VALID_DRPT_SIZE(x)                                                  \
(   !((x) & ~(DMA_RPT_DRPT_Msk >> DMA_RPT_DRPT_Pos)))

/*! Parameter valid check for Dmac source repeatB size. */
#define IS_VALID_SRPTB_SIZE(x)                                                 \
(   !((x) & ~(DMA_RPTB_SRPTB_Msk >> DMA_RPTB_SRPTB_Pos)))

/*! Parameter valid check for Dmac destinationB repeat size. */
#define IS_VALID_DRPTB_SIZE(x)                                                 \
(   !((x) & ~(DMA_RPTB_DRPTB_Msk >> DMA_RPTB_DRPTB_Pos)))

/*! Parameter valid check for Dmac source no-sequence count. */
#define IS_VALID_SNSCNT(x)                                                     \
(   !((x) & ~(DMA_SNSEQCTL_SNSCNT_Msk >> DMA_SNSEQCTL_SNSCNT_Pos)))

/*! Parameter valid check for Dmac source no-sequence offset. */
#define IS_VALID_SNSOFFSET(x)                                                  \
(   !((x) & ~(DMA_SNSEQCTL_SOFFSET_Msk >> DMA_SNSEQCTL_SOFFSET_Pos)))

/*! Parameter valid check for Dmac source no-sequence countB. */
#define IS_VALID_SNSCNTB(x)                                                    \
(   !((x) & ~(DMA_SNSEQCTLB_SNSCNTB_Msk >> DMA_SNSEQCTLB_SNSCNTB_Pos)))

/*! Parameter valid check for Dmac source no-sequence distance. */
#define IS_VALID_SNSDIST(x)                                                    \
(   !((x) & ~(DMA_SNSEQCTLB_SNSDIST_Msk >> DMA_SNSEQCTLB_SNSDIST_Pos)))

/*! Parameter valid check for Dmac destination no-sequence count. */
#define IS_VALID_DNSCNT(x)                                                     \
(   !((x) & ~(DMA_DNSEQCTL_DNSCNT_Msk >> DMA_DNSEQCTL_DNSCNT_Pos)))

/*! Parameter valid check for Dmac destination no-sequence offset. */
#define IS_VALID_DNSOFFSET(x)                                                  \
(   !((x) & ~(DMA_DNSEQCTL_DOFFSET_Msk >> DMA_DNSEQCTL_DOFFSET_Pos)))

