RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_dmac.c
    switch(enDmaChFlag)
    {
        case DmaSta:
            u32IntStat = pstcDmaReg->CHSTAT_f.DMAACT;
            break;
        case ReCfgSta:
            u32IntStat = pstcDmaReg->CHSTAT_f.RCFGACT;
            break;
        case DmaCh0Sta:
            u32IntStat = (pstcDmaReg->CHSTAT_f.CHACT & DMACH0);
            break;
        case DmaCh1Sta:
            u32IntStat = (pstcDmaReg->CHSTAT_f.CHACT & DMACH1);
            break;
        case DmaCh2Sta:
            u32IntStat = (pstcDmaReg->CHSTAT_f.CHACT & DMACH2);
            break;
        case DmaCh3Sta:
            u32IntStat = (pstcDmaReg->CHSTAT_f.CHACT & DMACH3);
            break;
        default:
            break;
    }
    return (u32IntStat ? Set:Reset);
}

/**
 *******************************************************************************
 ** \brief  Set the source address of the specified dma channel.
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 registers
 ** \arg    M4_DMA2                     DMAC unit 2 registers
 **
 ** \param  [in] u8Ch                   The specified dma channel.
 ** \param  [in] u32Address             The source address.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
en_result_t DMA_SetSrcAddress(M4_DMA_TypeDef* pstcDmaReg, uint8_t u8Ch, uint32_t u32Address)
{
    uint16_t u16Timeout = 0u;
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_CH(u8Ch));

    WRITE_DMA_CH_REG(&pstcDmaReg->SAR0, u8Ch, u32Address);

    /* Ensure the address has been writed */
    while(u32Address != READ_DMA_CH_REG(&pstcDmaReg->MONSAR0, u8Ch))
    {
        u16Timeout++;
        if(u16Timeout > DMATIMEOUT2)
        {
            enRet = ErrorTimeout;
        }
        else
        {
            WRITE_DMA_CH_REG(&pstcDmaReg->SAR0, u8Ch, u32Address);
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Set the destination address of the specified dma channel.
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 registers
 ** \arg    M4_DMA2                     DMAC unit 2 registers
 **
 ** \param  [in] u8Ch                   The specified dma channel.
 ** \param  [in] u32Address             The destination address.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
en_result_t DMA_SetDesAddress(M4_DMA_TypeDef* pstcDmaReg, uint8_t u8Ch, uint32_t u32Address)
{
    uint16_t u16Timeout = 0u;
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_CH(u8Ch));

    WRITE_DMA_CH_REG(&pstcDmaReg->DAR0, u8Ch, u32Address);

    /* Ensure the address has been writed */
    while(u32Address != READ_DMA_CH_REG(&pstcDmaReg->MONDAR0, u8Ch))
    {
        u16Timeout++;
        if(u16Timeout > DMATIMEOUT2)
        {
            enRet = ErrorTimeout;
        }
        else
        {
            WRITE_DMA_CH_REG(&pstcDmaReg->DAR0, u8Ch, u32Address);
        }
    }

    return enRet;

}


/**
 *******************************************************************************
 ** \brief  Set the block size of the specified dma channel.
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 registers
 ** \arg    M4_DMA2
 **
 ** \param  [in] u8Ch                   The specified dma channel.
 ** \param  [in] u16BlkSize             The block size.
 **
 ** \retval None.
 **
 ** \note   None
 **
 ******************************************************************************/
en_result_t DMA_SetBlockSize(M4_DMA_TypeDef* pstcDmaReg, uint8_t u8Ch, uint16_t u16BlkSize)
{
    uint16_t u16Timeout = 0u;
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_CH(u8Ch));
    DDL_ASSERT(IS_VALID_BLKSIZE(u16BlkSize));

    MODIFY_DMA_CH_REG(&pstcDmaReg->DTCTL0, u8Ch, DMA_DTCTL_BLKSIZE, (uint32_t)u16BlkSize);

    /* Ensure the block size has been writed */
    while(u16BlkSize != (uint16_t)(READ_DMA_CH_REG(&pstcDmaReg->MONDTCTL0, u8Ch) & DMA_DTCTL_BLKSIZE))
    {
        u16Timeout++;
        if(u16Timeout > DMATIMEOUT2)
        {
            enRet = ErrorTimeout;
        }
        else
        {
            MODIFY_DMA_CH_REG(&pstcDmaReg->DTCTL0, u8Ch, DMA_DTCTL_BLKSIZE, (uint32_t)u16BlkSize);
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Set the transfer count of the specified dma channel.
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 registers
 ** \arg    M4_DMA2
 **
 ** \param  [in] u8Ch                   The specified dma channel.
 ** \param  [in] u16TrnCnt              The transfer count.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
en_result_t DMA_SetTransferCnt(M4_DMA_TypeDef* pstcDmaReg, uint8_t u8Ch, uint16_t u16TrnCnt)
{
    uint16_t u16Timeout = 0u;
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_CH(u8Ch));
    DDL_ASSERT(IS_VALID_TRNCNT(u16TrnCnt));

    MODIFY_DMA_CH_REG(&pstcDmaReg->DTCTL0, u8Ch, DMA_DTCTL_CNT, (uint32_t)u16TrnCnt);

    /* Ensure the transfer count has been writed */
    while(u16TrnCnt != ((READ_DMA_CH_REG(&pstcDmaReg->MONDTCTL0, u8Ch) & DMA_DTCTL_CNT) >> DMA_DTCTL_CNT_Pos))
    {
        u16Timeout++;
        if(u16Timeout > DMATIMEOUT2)
        {
            enRet = ErrorTimeout;
        }
        else
        {
            MODIFY_DMA_CH_REG(&pstcDmaReg->DTCTL0, u8Ch, DMA_DTCTL_CNT, (uint32_t)u16TrnCnt);
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Set the source repeat size of the specified dma channel.
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 registers
 ** \arg    M4_DMA2
 **
 ** \param  [in] u8Ch                   The specified dma channel.
 ** \param  [in] u16Size                The source repeat size.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
en_result_t DMA_SetSrcRptSize(M4_DMA_TypeDef* pstcDmaReg, uint8_t u8Ch, uint16_t u16Size)
{
    uint16_t u16Timeout = 0u;
    en_result_t enRet = Ok;

