RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_dmac.c
    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_CH(u8Ch));
    DDL_ASSERT(IS_VALID_SNSDIST(pstcSrcNseqBCfg->u32NseqDist));
    DDL_ASSERT(IS_VALID_SNSCNTB(pstcSrcNseqBCfg->u16CntB));

    MODIFY_DMA_CH_REG(&pstcDmaReg->SNSEQCTLB0, u8Ch, DMA_SNSEQCTLB_SNSDIST, pstcSrcNseqBCfg->u32NseqDist);
    MODIFY_DMA_CH_REG(&pstcDmaReg->SNSEQCTLB0, u8Ch, DMA_SNSEQCTLB_SNSCNTB, (uint32_t)pstcSrcNseqBCfg->u16CntB);

    /* Ensure the no-sequence offset & count has been writed */
    while((pstcSrcNseqBCfg->u32NseqDist | ((uint32_t)pstcSrcNseqBCfg->u16CntB << DMA_SNSEQCTLB_SNSCNTB_Pos))
            != READ_DMA_CH_REG(&pstcDmaReg->SNSEQCTLB0, u8Ch))
    {
        u16Timeout++;
        if(u16Timeout > DMATIMEOUT2)
        {
            enRet = ErrorTimeout;
        }
        else
        {
            MODIFY_DMA_CH_REG(&pstcDmaReg->SNSEQCTLB0, u8Ch,
                               DMA_SNSEQCTLB_SNSDIST, pstcSrcNseqBCfg->u32NseqDist);
            MODIFY_DMA_CH_REG(&pstcDmaReg->SNSEQCTLB0, u8Ch,
                               DMA_SNSEQCTLB_SNSCNTB, (uint32_t)pstcSrcNseqBCfg->u16CntB);
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Set the destination no-sequence offset & count of the specified dma channel.
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 registers
 ** \arg    M4_DMA2
 **
 ** \param  [in] u8Ch                   The specified dma channel.
 ** \param  [in] pstcDesNseqCfg
 ** \arg    u32offset                   The destination no-sequence offset.
 ** \arg    u16cnt                      The destination no-sequence count.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
en_result_t DMA_SetDesNseqCfg(M4_DMA_TypeDef* pstcDmaReg, uint8_t u8Ch,
                        const stc_dma_nseq_cfg_t* pstcDesNseqCfg)
{
    uint16_t u16Timeout = 0u;
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_CH(u8Ch));
    DDL_ASSERT(IS_VALID_DNSOFFSET(pstcDesNseqCfg->u32Offset));
    DDL_ASSERT(IS_VALID_DNSCNT(pstcDesNseqCfg->u16Cnt));

    MODIFY_DMA_CH_REG(&pstcDmaReg->DNSEQCTL0, u8Ch, DMA_DNSEQCTL_DOFFSET, pstcDesNseqCfg->u32Offset);
    MODIFY_DMA_CH_REG(&pstcDmaReg->DNSEQCTL0, u8Ch, DMA_DNSEQCTL_DNSCNT, (uint32_t)pstcDesNseqCfg->u16Cnt);

    /* Ensure the no-sequence offset & count has been writed */
    while((pstcDesNseqCfg->u32Offset | ((uint32_t)pstcDesNseqCfg->u16Cnt << DMA_DNSEQCTL_DNSCNT_Pos))
            != READ_DMA_CH_REG(&pstcDmaReg->MONDNSEQCTL0, u8Ch))
    {
        u16Timeout++;
        if(u16Timeout > DMATIMEOUT2)
        {
            enRet = ErrorTimeout;
        }
        else
        {
            MODIFY_DMA_CH_REG(&pstcDmaReg->DNSEQCTL0, u8Ch,
                              DMA_DNSEQCTL_DOFFSET, pstcDesNseqCfg->u32Offset);
            MODIFY_DMA_CH_REG(&pstcDmaReg->DNSEQCTL0, u8Ch,
                              DMA_DNSEQCTL_DNSCNT, (uint32_t)pstcDesNseqCfg->u16Cnt);
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Set the destination no-sequence offset & count of the specified dma channel.
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 registers
 ** \arg    M4_DMA2
 **
 ** \param  [in] u8Ch                   The specified dma channel.
 ** \param  [in] pstcDesNseqBCfg
 ** \arg    u32offset                   The destination no-sequence offset.
 ** \arg    u16cnt                      The destination no-sequence count.
 **
 ** \retval None
 **
 ** \note   None
 **
 ******************************************************************************/
en_result_t DMA_SetDesNseqBCfg(M4_DMA_TypeDef* pstcDmaReg, uint8_t u8Ch,
                        const stc_dma_nseqb_cfg_t* pstcDesNseqBCfg)
{
    uint16_t u16Timeout = 0u;
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_CH(u8Ch));
    DDL_ASSERT(IS_VALID_DNSDIST(pstcDesNseqBCfg->u32NseqDist));
    DDL_ASSERT(IS_VALID_DNSCNTB(pstcDesNseqBCfg->u16CntB));

    MODIFY_DMA_CH_REG(&pstcDmaReg->DNSEQCTLB0, u8Ch, DMA_DNSEQCTLB_DNSDIST, pstcDesNseqBCfg->u32NseqDist);
    MODIFY_DMA_CH_REG(&pstcDmaReg->DNSEQCTLB0, u8Ch, DMA_DNSEQCTLB_DNSCNTB, (uint32_t)pstcDesNseqBCfg->u16CntB);

    /* Ensure the no-sequence offset & count has been writed */
    while((pstcDesNseqBCfg->u32NseqDist | ((uint32_t)pstcDesNseqBCfg->u16CntB << DMA_DNSEQCTLB_DNSCNTB_Pos))
            != READ_DMA_CH_REG(&pstcDmaReg->DNSEQCTLB0, u8Ch))
    {
        u16Timeout++;
        if(u16Timeout > DMATIMEOUT2)
        {
            enRet = ErrorTimeout;
        }
        else
        {
            MODIFY_DMA_CH_REG(&pstcDmaReg->DNSEQCTLB0, u8Ch,
                              DMA_DNSEQCTLB_DNSDIST, pstcDesNseqBCfg->u32NseqDist);
            MODIFY_DMA_CH_REG(&pstcDmaReg->DNSEQCTLB0, u8Ch,
                              DMA_DNSEQCTLB_DNSCNTB, (uint32_t)pstcDesNseqBCfg->u16CntB);
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Set linked list pointer of the specified dma channel.
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 registers
 ** \arg    M4_DMA2
 **
 ** \param  [in] u8Ch                   The specified dma channel.
 ** \param  [in] u32Pointer             The decriptor pointer.
 **
 ** \retval None.
 **
 ** \note   None
 **
 ******************************************************************************/
en_result_t DMA_SetLLP(M4_DMA_TypeDef* pstcDmaReg, uint8_t u8Ch, uint32_t u32Pointer)
{
    uint16_t u16Timeout = 0u;
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_CH(u8Ch));
    DDL_ASSERT(IS_VALID_LLP(u32Pointer));

    WRITE_DMA_CH_REG(&pstcDmaReg->LLP0, u8Ch, u32Pointer);

    /* Ensure the destination repeat size has been writed */
    while(u32Pointer != ((READ_DMA_CH_REG(&pstcDmaReg->LLP0, u8Ch) & DMA_LLP_LLP) >> DMA_LLP_LLP_Pos))
    {
        u16Timeout++;
        if(u16Timeout > DMATIMEOUT2)
        {
            enRet = ErrorTimeout;
        }
        else
        {
            WRITE_DMA_CH_REG(&pstcDmaReg->LLP0, u8Ch, u32Pointer);
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Set The DMA trigger source.
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 registers
 ** \arg    M4_DMA2
 **
 ** \param  [in] u8Ch                   The specified dma channel.
 ** \param  [in] enSrc                  The DMA trigger source.
 **
 ** \retval None.
 **
 ** \note   Before call this function, shoud ensure enable AOS.
 **
 ******************************************************************************/
void DMA_SetTriggerSrc(const M4_DMA_TypeDef* pstcDmaReg, uint8_t u8Ch, en_event_src_t enSrc)
{
    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));

