RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_dmac.c
    if(M4_DMA1 == pstcDmaReg)
    {
        WRITE_DMA_CH_TRGSEL(&M4_AOS->DMA1_TRGSEL0,u8Ch,enSrc);
    }
    else if(M4_DMA2 == pstcDmaReg)
    {
        WRITE_DMA_CH_TRGSEL(&M4_AOS->DMA2_TRGSEL0,u8Ch,enSrc);
    }
    else
    {
        //else
    }
}

/**
 *******************************************************************************
 ** \brief  Enable or disable DMA common trigger..
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 registers
 ** \arg    M4_DMA2
 ** \param  [in] u8Ch                   The specified dma channel.
 ** \param  [in] enComTrigger           DMA common trigger selection.
 ** \arg    DmaComTrigger_1
 ** \arg    DmaComTrigger_2
 ** \arg    DmaComTrigger_1_2
 ** \param  [in] enNewState             Enable or disable the specified common trigger.
 **
 ** \retval None.
 **
 ******************************************************************************/
void DMA_ComTriggerCmd(M4_DMA_TypeDef* pstcDmaReg, uint8_t u8Ch,
                        en_dma_com_trigger_t enComTrigger, en_functional_state_t enNewState)
{
    __IO uint32_t *TRGSELx;
    uint32_t u32ComTrig = (uint32_t)enComTrigger;

    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_CH(u8Ch));
    DDL_ASSERT(IS_DMA_COM_TRIGGER(enComTrigger));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (M4_DMA1 == pstcDmaReg)
    {
        TRGSELx = (uint32_t *)((uint32_t)(&M4_AOS->DMA1_TRGSEL0) + u8Ch*4UL);
    }
    else
    {
        TRGSELx = (uint32_t *)((uint32_t)(&M4_AOS->DMA2_TRGSEL0) + u8Ch*4UL);
    }

    if (Enable == enNewState)
    {
        *TRGSELx |= (u32ComTrig << 30u);
    }
    else
    {
        *TRGSELx &= ~(u32ComTrig << 30u);
    }
}

/**
 *******************************************************************************
 ** \brief  Enable or disable DMA re-config common trigger..
 **
 ** \param  [in] enComTrigger           DMA common trigger selection.
 ** \arg    DmaComTrigger_1
 ** \arg    DmaComTrigger_2
 ** \arg    DmaComTrigger_1_2
 ** \param  [in] enNewState             Enable or disable the specified common trigger.
 **
 ** \retval None.
 **
 ******************************************************************************/
void DMA_ReConfigComTriggerCmd(en_dma_com_trigger_t enComTrigger, en_functional_state_t enNewState)
{
    uint32_t u32ComTrig = (uint32_t)enComTrigger;

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_DMA_COM_TRIGGER(enComTrigger));

    if (Enable == enNewState)
    {
        M4_AOS->DMA_TRGSELRC |= (u32ComTrig << 30u);
    }
    else
    {
        M4_AOS->DMA_TRGSELRC &= ~(u32ComTrig << 30u);
    }
}
/**
 *******************************************************************************
 ** \brief  Set linked list pointer of the specified dma channel.
 **
 ** \param  [in] enSrc                  The DMA trigger source.
 **
 ** \retval None.
 **
 ** \note   Before call this function, should ensure enable AOS.
 **
 ******************************************************************************/
void DMA_SetReConfigTriggerSrc(en_event_src_t enSrc)
{

    M4_AOS->DMA_TRGSELRC_f.TRGSEL = enSrc;

}
/**
 *******************************************************************************
 ** \brief  The configuration of the specified dma channel.
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 registers
 ** \arg    M4_DMA2
 **
 ** \param  [in] u8Ch                   The specified dma channel.
 ** \param  [in] pstcChCfg              The configuration pointer.
 ** \arg    enSrcInc                    The source address mode.
 ** \arg    enDesInc                    The destination address mode.
 ** \arg    enSrcRptEn                  The source repeat function(enable or disable).
 ** \arg    enDesRptEn                  The destination repeat function(enable or disable).
 ** \arg    enSrcNseqEn                 The source no_sequence function(enable or disable).
 ** \arg    enDesNseqEn                 The destination no_sequence function(enable or disable).
 ** \arg    enTrnWidth                  The transfer data width.
 ** \arg    enLlpEn                     The linked list pointer function(enable or disable).
 ** \arg    enLlpMd                     The linked list pointer mode.
 ** \arg    enIntEn                     The interrupt function(enable or disable).
 **
 ** \retval None.
 **
 ** \note   None
 **
 ******************************************************************************/
void DMA_ChannelCfg(M4_DMA_TypeDef* pstcDmaReg, uint8_t u8Ch,
                    const stc_dma_ch_cfg_t* pstcChCfg)
{
    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_CH(u8Ch));
    DDL_ASSERT(IS_VALID_ADDR_MODE(pstcChCfg->enSrcInc));
    DDL_ASSERT(IS_VALID_ADDR_MODE(pstcChCfg->enDesInc));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcChCfg->enSrcRptEn));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcChCfg->enDesRptEn));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcChCfg->enSrcNseqEn));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcChCfg->enDesNseqEn));
    DDL_ASSERT(IS_VALID_TRN_WIDTH(pstcChCfg->enTrnWidth));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcChCfg->enLlpEn));
    DDL_ASSERT(IS_VALID_LLP_MODE(pstcChCfg->enLlpMd));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcChCfg->enIntEn));

    /* Set the source address mode. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->CH0CTL, u8Ch, DMA_CHCTL_SINC, pstcChCfg->enSrcInc);
    /* Set the destination address mode. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->CH0CTL, u8Ch, DMA_CHCTL_DINC, pstcChCfg->enDesInc);
    /* Enable or disable source repeat function. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->CH0CTL, u8Ch, DMA_CHCTL_SRPTEN, pstcChCfg->enSrcRptEn);
    /* Enable or disable destination repeat function. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->CH0CTL, u8Ch, DMA_CHCTL_DRPTEN, pstcChCfg->enDesRptEn);
    /* Enable or disable source no_sequence function. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->CH0CTL, u8Ch, DMA_CHCTL_SNSEQEN, pstcChCfg->enSrcNseqEn);
    /* Enable or disable destination no_sequence function. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->CH0CTL, u8Ch, DMA_CHCTL_DNSEQEN, pstcChCfg->enDesNseqEn);
    /* Set the transfer data width. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->CH0CTL, u8Ch, DMA_CHCTL_HSIZE, pstcChCfg->enTrnWidth);
    /* Enable or disable linked list pointer no_sequence function. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->CH0CTL, u8Ch, DMA_CHCTL_LLPEN, pstcChCfg->enLlpEn);
    /* Set the linked list pointer mode. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->CH0CTL, u8Ch, DMA_CHCTL_LLPRUN, pstcChCfg->enLlpMd);
    /* Enable or disable channel interrupt function. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->CH0CTL, u8Ch, DMA_CHCTL_IE, pstcChCfg->enIntEn);
}

/**
 *******************************************************************************
 ** \brief  The configuration of the specified dma channel.
 **
 ** \param  [in] pstcDmaReg             The pointer to dma register
 ** \arg    M4_DMA1                     DMAC unit 1 registers
 ** \arg    M4_DMA2
 **
 ** \param  [in] u8Ch                   The specified dma channel.
 ** \param  [in] pstcDmaCfg             The configuration pointer.
 ** \arg    enSrcInc                    The source address mode.
 ** \arg    enDesInc                    The destination address mode.
 ** \arg    enSrcRptEn                  The source repeat function(enable or disable).
 ** \arg    enDesRptEn                  The destination repeat function(enable or disable).
 ** \arg    enSrcNseqEn                 The source no_sequence function(enable or disable).
 ** \arg    enDesNseqEn                 The destination no_sequence function(enable or disable).
 ** \arg    enTrnWidth                  The transfer data width.
 ** \arg    enLlpEn                     The linked list pointer function(enable or disable).
 ** \arg    enLlpMd                     The linked list pointer mode.
 ** \arg    enIntEn                     The interrupt function(enable or disable).
 **
 ** \retval None.
 **
 ** \note   This function should be used after enable DMAx clk(PWC_Fcg0PeriphClockCmd)
 **         and before channel enable.
 **
 ******************************************************************************/
void DMA_InitChannel(M4_DMA_TypeDef* pstcDmaReg, uint8_t u8Ch,
                        const stc_dma_config_t* pstcDmaCfg)
{
    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_CH(u8Ch));
    DDL_ASSERT(IS_VALID_BLKSIZE(pstcDmaCfg->u16BlockSize));
    DDL_ASSERT(IS_VALID_TRNCNT(pstcDmaCfg->u16TransferCnt));
    DDL_ASSERT(IS_VALID_SRPT_SIZE(pstcDmaCfg->u16SrcRptSize));
    DDL_ASSERT(IS_VALID_DRPT_SIZE(pstcDmaCfg->u16DesRptSize));

    /* Enable DMA. */
    DMA_Cmd(pstcDmaReg, Enable);
    /* Disable DMA interrupt */
    CLR_DMA_CH_REG_BIT(&pstcDmaReg->CH0CTL , u8Ch, DMA_CHCTL_IE_Pos);
    /* Set DMA source address. */
    WRITE_DMA_CH_REG(&pstcDmaReg->SAR0, u8Ch,  pstcDmaCfg->u32SrcAddr);
    /* Set DMA destination address. */
    WRITE_DMA_CH_REG(&pstcDmaReg->DAR0, u8Ch, pstcDmaCfg->u32DesAddr);
    /* Set DMA transfer block size. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->DTCTL0, u8Ch, DMA_DTCTL_BLKSIZE, (uint32_t)pstcDmaCfg->u16BlockSize);
    /* Set DMA transfer count. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->DTCTL0, u8Ch, DMA_DTCTL_CNT, (uint32_t)pstcDmaCfg->u16TransferCnt);
    /* Set DMA source repeat size. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->RPT0, u8Ch, DMA_RPT_SRPT, (uint32_t)pstcDmaCfg->u16SrcRptSize);
    /* Set DMA destination repeat size. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->RPT0, u8Ch, DMA_RPT_DRPT, (uint32_t)pstcDmaCfg->u16DesRptSize);
    /* Set DMA source no_sequence. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->SNSEQCTL0, u8Ch, DMA_SNSEQCTL_SOFFSET, pstcDmaCfg->stcSrcNseqCfg.u32Offset);
    MODIFY_DMA_CH_REG(&pstcDmaReg->SNSEQCTL0, u8Ch, DMA_SNSEQCTL_SNSCNT, (uint32_t)pstcDmaCfg->stcSrcNseqCfg.u16Cnt);
    /* Set DMA destination no_sequence. */
    MODIFY_DMA_CH_REG(&pstcDmaReg->DNSEQCTL0, u8Ch, DMA_DNSEQCTL_DOFFSET, pstcDmaCfg->stcDesNseqCfg.u32Offset);
    MODIFY_DMA_CH_REG(&pstcDmaReg->DNSEQCTL0, u8Ch, DMA_DNSEQCTL_DNSCNT, (uint32_t)pstcDmaCfg->stcDesNseqCfg.u16Cnt);
    /* Set DMA linked list pointer. */
    WRITE_DMA_CH_REG(&pstcDmaReg->LLP0, u8Ch, pstcDmaCfg->u32DmaLlp);
    /* Set DMA channel parameter. */
    DMA_ChannelCfg(pstcDmaReg, u8Ch, &pstcDmaCfg->stcDmaChCfg);
}

void DMA_DeInit(M4_DMA_TypeDef* pstcDmaReg, uint8_t u8Ch)
{
    DDL_ASSERT(IS_VALID_DMA_REG(pstcDmaReg));
    DDL_ASSERT(IS_VALID_CH(u8Ch));

    /* reset dma channel */
    WRITE_DMA_CH_REG(&pstcDmaReg->CH0CTL, u8Ch, DMA_CHCTL_DEFAULT);
    WRITE_DMA_CH_REG(&pstcDmaReg->DTCTL0, u8Ch, DMA_DTCTL_DEFAULT);
    WRITE_DMA_CH_REG(&pstcDmaReg->DAR0, u8Ch, DMA_DAR_DEFAULT);
    WRITE_DMA_CH_REG(&pstcDmaReg->SAR0, u8Ch, DMA_SAR_DEFAULT);
    WRITE_DMA_CH_REG(&pstcDmaReg->SNSEQCTL0, u8Ch, DMA_SNSEQCTL_DEFAULT);
    WRITE_DMA_CH_REG(&pstcDmaReg->DNSEQCTL0, u8Ch, DMA_DNSEQCTL_DEFAULT);
    WRITE_DMA_CH_REG(&pstcDmaReg->RPT0, u8Ch, DMA_RPT_DEFAULT);
    WRITE_DMA_CH_REG(&pstcDmaReg->LLP0, u8Ch, DMA_LLP_DEFAULT);
    WRITE_DMA_CH_REG(&pstcDmaReg->RCFGCTL, u8Ch, DMA_RCFGCTL_DEFAULT);

    /* Set trigger source event max */
    DMA_SetTriggerSrc(pstcDmaReg, u8Ch, EVT_MAX);
    /* disable channel */
    DMA_ChannelCmd(pstcDmaReg, u8Ch, Disable);
}

#endif /* DDL_DMAC_ENABLE */

//@} // DmacGroup

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
